Revit 2027 API
ParameterTypeId.LightingFixtureLightEmitter Property
 "Light Emitter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LightingFixtureLightEmitter { get; }
Public Shared ReadOnly Property LightingFixtureLightEmitter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LightingFixtureLightEmitter {
	ForgeTypeId^ get ();
}
static member LightingFixtureLightEmitter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace